app/controllers/activities_controller.rb

SELECT "achievements".* FROM "achievements" WHERE "achievements"."completed" = $1 AND (date >= '2025-06-23') ORDER BY "achievements"."date" DESC, "achievements"."updated_at" DESC  [["completed", true]]
---
  def history
    @activities = UserActivity.recent_activities(10) # 過去10日分を表示（実際のデータのみ）
    @achievements = Achievement.where(completed: true).where('date >= ?', 10.days.ago.to_date).order(date: :desc, updated_at: :desc)

SELECT "user_activities".* FROM "user_activities" WHERE "user_activities"."date" = $1 ORDER BY "user_activities"."created_at" ASC  [["date", "2025-06-02"]]
SELECT "achievements".* FROM "achievements" WHERE "achievements"."date" = $1 AND "achievements"."completed" = $2 ORDER BY "achievements"."updated_at" ASC  [["date", "2025-07-03"], ["completed", true]]
---
  def daily
    @date = Date.parse(params[:date])
    @activities = UserActivity.where(date: @date).order(:created_at)
    @achievements = Achievement.where(date: @date, completed: true).order(:updated_at)