app/controllers/api_controller.rb

SELECT "stretches".* FROM "stretches"
---
  def get_todays_stretch(date)
    srand(date.to_time.to_i)
    Stretch.all.sample

SELECT "breathing_exercises".* FROM "breathing_exercises"
---
  def get_todays_breathing(date)
    srand(date.to_time.to_i + 1000)
    BreathingExercise.all.sample

SELECT "daily_messages".* FROM "daily_messages"
---
  def get_todays_message(date)
    srand(date.to_time.to_i + 2000)
    DailyMessage.all.sample