app/controllers/home_controller.rb

  def record_achievement
    # JSONパラメータからactivity_typeを取得
    activity_type = params[:activity_type] || JSON.parse(request.body.read)['activity_type']
    date = Date.current

    # 既存の実績を確認
    achievement = Achievement.find_or_initialize_by(date: date, activity_type: activity_type)
---
SELECT "achievements".* FROM "achievements" WHERE "achievements"."date" = $1 AND "achievements"."activity_type" = $2 LIMIT $3  [["date", "2025-07-03"], ["activity_type", "stretch"], ["LIMIT", 1]]

  def get_todays_breathing
    # 日付に基づいてランダムに呼吸法を選択（同じ日は同じ結果）
    srand(@today.to_time.to_i + 1000) # ストレッチと異なる結果にするため
    BreathingExercise.all.sample
---
SELECT "breathing_exercises".* FROM "breathing_exercises"

  def get_todays_message
    # 日付に基づいてランダムにメッセージを選択（同じ日は同じ結果）
    srand(@today.to_time.to_i + 2000) # 他のコンテンツと異なる結果にするため
    DailyMessage.all.sample
---
SELECT "daily_messages".* FROM "daily_messages"