app/controllers/home_controller.rb

  def reset_data
    # 過去のデータをリセット
    UserActivity.delete_all
    Achievement.delete_all
---
DELETE FROM "user_activities"
DELETE FROM "achievements"

  def record_achievement
    # パラメータからactivity_typeとactivity_idを取得
    activity_type = params[:activity_type] || params.dig(:home, :activity_type)
    activity_id = params[:activity_id]
    date = Date.current
    @today = date  # @todayを設定

    # デバッグログ
    Rails.logger.info "record_achievement called with activity_type: #{activity_type}, activity_id: #{activity_id}"

    # activity_idが指定されていない場合は、今日の活動から取得
    unless activity_id
      case activity_type
      when 'stretch'
        srand(@today.to_time.to_i)
        activity_id = Stretch.all.sample.id
      when 'breathing'
        srand(@today.to_time.to_i + 1000)
        activity_id = BreathingExercise.all.sample.id
      end
    end

    # 既存の実績を確認（activity_idも含めて）
    achievement = Achievement.find_or_initialize_by(date: date, activity_type: activity_type, activity_id: activity_id)
---
SELECT "stretches".* FROM "stretches"
SELECT "breathing_exercises".* FROM "breathing_exercises"
SELECT "achievements".* FROM "achievements" WHERE "achievements"."date" = $1 AND "achievements"."activity_type" = $2 LIMIT $3  [["date", "2025-07-03"], ["activity_type", "stretch"], ["LIMIT", 1]]

  def reset_achievement
    # パラメータからactivity_typeとactivity_idを取得
    activity_type = params[:activity_type] || params.dig(:home, :activity_type)
    activity_id = params[:activity_id]
    date = Date.current
    @today = date  # @todayを設定

    # activity_idが指定されていない場合は、今日の活動から取得
    unless activity_id
      case activity_type
      when 'stretch'
        srand(@today.to_time.to_i)
        activity_id = Stretch.all.sample.id
      when 'breathing'
        srand(@today.to_time.to_i + 1000)
        activity_id = BreathingExercise.all.sample.id
      end
    end

    # 今日の実績を削除（activity_idも含めて）
    achievement = Achievement.find_by(date: date, activity_type: activity_type, activity_id: activity_id)
    achievement&.destroy
---
SELECT "stretches".* FROM "stretches"
SELECT "breathing_exercises".* FROM "breathing_exercises"
SELECT "achievements".* FROM "achievements" WHERE "achievements"."date" = $1 AND "achievements"."activity_type" = $2 LIMIT $3  [["date", "2025-07-03"], ["activity_type", "breathing"], ["LIMIT", 1]]
DELETE FROM "achievements" WHERE "achievements"."id" = $1  [["id", 1]]

  def get_another_stretch
    # 別のストレッチを取得
    current_stretch_id = params[:current_id].to_i
    other_stretches = Stretch.where.not(id: current_stretch_id)
---
SELECT "stretches".* FROM "stretches"

  def export_data
    # ユーザーデータを収集
    data = {
      achievements: Achievement.all.map { |a| { date: a.date, activity_type: a.activity_type, completed: a.completed } },
      user_activities: UserActivity.all.map { |ua| { date: ua.date, activity_name: ua.activity_name, activity_category: ua.activity_category } },
      export_date: Time.current.iso8601
---
SELECT "achievements".* FROM "achievements"
SELECT "user_activities".* FROM "user_activities"

  def get_todays_stretch
    # 日付に基づいてランダムにストレッチを選択（同じ日は同じ結果）
    srand(@today.to_time.to_i)
    Stretch.all.sample
---
SELECT "stretches".* FROM "stretches"

  def get_todays_breathing
    # 日付に基づいてランダムに呼吸法を選択（同じ日は同じ結果）
    srand(@today.to_time.to_i + 1000) # ストレッチと異なる結果にするため
    BreathingExercise.all.sample
---
SELECT "breathing_exercises".* FROM "breathing_exercises"

  def get_todays_achievements
    today = Date.current
    @today = today  # @todayを設定

    # 今日のストレッチと呼吸法のIDを取得
    srand(@today.to_time.to_i)
    stretch_id = Stretch.all.sample.id
    srand(@today.to_time.to_i + 1000)
    breathing_id = BreathingExercise.all.sample.id

    {
      stretch: Achievement.find_by(date: today, activity_type: 'stretch', activity_id: stretch_id)&.completed || false,
      breathing: Achievement.find_by(date: today, activity_type: 'breathing', activity_id: breathing_id)&.completed || false
---
SELECT "stretches".* FROM "stretches"
SELECT "breathing_exercises".* FROM "breathing_exercises"
SELECT "achievements".* FROM "achievements" WHERE "achievements"."date" = $1 AND "achievements"."activity_type" = $2 AND "achievements"."activity_id" = $3 LIMIT $4  [["date", "2025-07-03"], ["activity_type", "breathing"], ["activity_id", 4], ["LIMIT", 1]]