app/controllers/home_controller.rb

  def get_another_breathing
    # 別の呼吸法を取得
    current_breathing_id = params[:current_id].to_i
    other_breathing = BreathingExercise.where.not(id: current_breathing_id)
---
SELECT "breathing_exercises".* FROM "breathing_exercises"

  def export_data
    # ユーザーデータを収集
    data = {
      achievements: Achievement.all.map { |a| { date: a.date, activity_type: a.activity_type, completed: a.completed } },
      user_activities: UserActivity.all.map { |ua| { date: ua.date, activity_name: ua.activity_name, activity_category: ua.activity_category } },
      export_date: Time.current.iso8601
---
SELECT "achievements".* FROM "achievements" WHERE "achievements"."date" = $1 AND "achievements"."activity_type" = $2 LIMIT $3  [["date", "2025-07-03"], ["activity_type", "breathing"], ["LIMIT", 1]]