app/models/achievement.rb

  def self.monthly_stats
    achievements = where(completed: true).where('date >= ?', Date.current - 30.days)

    # 日付ごとの完了数を集計
    daily_counts = achievements.group(:date, :activity_type).count
---
SELECT COUNT(*) AS "count_all", "achievements"."date" AS "achievements_date", "achievements"."activity_type" AS "achievements_activity_type" FROM "achievements" WHERE "achievements"."completed" = $1 AND (date >= '2025-06-03') GROUP BY "achievements"."date", "achievements"."activity_type"  [["completed", true]]