app/models/encouragement_message.rb

SELECT "encouragement_messages".* FROM "encouragement_messages" WHERE "encouragement_messages"."category" = $1 ORDER BY RANDOM() LIMIT $2  [["category", "stretch"], ["LIMIT", 1]]
---
  def self.random_for_category(category)
    for_category(category).order('RANDOM()').first || general.order('RANDOM()').first