app/models/user_activity.rb

  def self.monthly_stats
    activities = monthly_activities

    # 日付ごとの活動数を集計
    daily_counts = activities.group(:date, :activity_type).count
---
SELECT COUNT(*) AS "count_all", "user_activities"."date" AS "user_activities_date", "user_activities"."activity_type" AS "user_activities_activity_type" FROM "user_activities" WHERE (date >= '2025-06-02') GROUP BY "user_activities"."date", "user_activities"."activity_type" ORDER BY "user_activities"."date" ASC

  def activity_details
    case activity_type
    when 'stretch'
      Stretch.find_by(id: activity_id)
    when 'breathing'
      BreathingExercise.find_by(id: activity_id)
---
SELECT "stretches".* FROM "stretches" WHERE "stretches"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "breathing_exercises".* FROM "breathing_exercises" WHERE "breathing_exercises"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]