app/views/activities/history.html.erb

            activities.each do |activity|
              unless date_achievements.any? { |a| a.activity_type == activity.activity_type && a.activity_id == activity.activity_id }
---
SELECT "user_activities".* FROM "user_activities" WHERE (date >= '2025-06-22') ORDER BY "user_activities"."date" DESC, "user_activities"."created_at" DESC
SELECT 1 AS one FROM "user_activities" WHERE (date >= '2025-06-22') LIMIT $1  [["LIMIT", 1]]